# BuiltInFailures.KeynoteTagFailures Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..KeynoteTagFailures Class
BuiltInFailures Class Members See Also
---
Failures related to keynote tags.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static class KeynoteTagFailures
```

Visual Basic
---
```text
Public NotInheritable Class KeynoteTagFailures
```

Visual C++
---
```text
public ref class KeynoteTagFailures abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..BuiltInFailures..::..KeynoteTagFailures
# See Also
BuiltInFailures..::..KeynoteTagFailures Members
Autodesk.Revit.DB Namespace